newtonltr/stm32h723zgt6-nx-tx/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include <string.h>
#include "eth.h"
#include "tx_api.h"
#include "nx_api.h"
#include "tx_thread.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern ETH_HandleTypeDef heth;

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PHY_RST_Pin GPIO_PIN_10
#define PHY_RST_GPIO_Port GPIOB
#define USART1_CK_Pin GPIO_PIN_8
#define USART1_CK_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */
void sleep_s(uint32_t s);
void sleep_ms(uint32_t ms);
void sleep_us(uint32_t us);

/* USER CODE BEGIN Private defines */
#define CONVERTER_PROTOCOL_HEAD 0XAA
#define CONVERTER_PROTOCOL_TAIL 0X55

enum frame_type_list {
  CAN_DATA_FRAME,
  CAN_REMOTE_FRAME,
};


__packed struct can_pack_protocol_head {
  uint8_t head;
  uint32_t id;
  uint8_t frame_type;
  uint8_t len;
};

__packed struct converter_protocol {
  struct can_pack_protocol_head header;
  uint8_t data[8];
  uint16_t crc;  
};

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
